
LIST_REPORT_NAME = "Звіт з харчування"

CLASS_WAS_NOT = float(0.0)
RESULT_NAME = "ВСЬОГО"

# Column names
NAME_TABLE_COL = ["Клас", "Кількість дітей \n за списком", "Кількість дітей,\n які харчуються",
                  "Дітоднів", "Сума", "Примітка"]

REPORT1_SIGNS_DICT = {"ДИРЕКТОР ХЗОШ № 95": "Н.В.МЕРЗЛЯКОВА",
                      "ЗАСТУПНИК ДИРЕКТОРА З НВР": "Т.О.ЛОБАЧ",
                      "ЗАВ. ВИРОБНИЦТВОМ": "М.В.ДЕГТЯР"}

CLASS_REPORT_SIGNS_DICT = {"ДИРЕКТОР ХЗОШ № 95": "Н.В.МЕРЗЛЯКОВА",
                           "ЗАСТУПНИК ДИРЕКТОРА З НВР": "Т.О.ЛОБАЧ",
                           "ЗАВ. ВИРОБНИЦТВОМ": "М.В.ДЕГТЯР",
                           }
CLASS_TEACHER = "КЛАСНИЙ КЕРІВНИК"

# Class report column names
CLASS_NAME_TABLE_COL = ["№", "ПІБ уч-ся", "Пропуски", "Дітоднів", "Сума"]
