
LIST_REPORT_NAME = "Звіт з харчування"

CLASS_WAS_NOT = float(0.0)
RESULT_NAME = "ВСЬОГО"

# Filling column names
NAME_TABLE_COL = ["Клас", "Кількість дітей \n за списком", "Кількість дітей,\n які харчуються",
                  "Дітоднів", "Сума", "Примітка"]

REPORT1_SIGNS_DICT = {"ДИРЕКТОР ХЗОШ № 95": "Н.В.МЕРЗЛЯКОВА",
                      "ЗАМ. ДИРЕКТОРА З НВР": "Т.О.ЛОБАЧ",
                      "ЗАВ. ВИРОБНИЦТВОМ": "М.В.ДЕГТЯР"}

# Filling class report column names
CLASS_NAME_TABLE_COL = ["№", "ПІБ уч-ся", "Пропуски", "Дітоднів", "Сума"]

# WORKING_DAYS = [3, 4,
#                 6, 7, 8, 9, 10,
#                 13, 14, 15, 16, 17,
#                 20, 21, 22, 23, 24,
#                 27, 28, 29, 30]

# Input data from classes files

# PRICE = 16.0

# data_1_classes = {
#     "1-А": [34, 33, 378, 378 * PRICE, ' '],
#     "1-Б": [36, 36, 258, 258 * PRICE, ' '],
#     "1-В": [34, 34, 381, 381 * PRICE, ' ']
# }
# all_1_classes = "ПЕРШІ"
#
# data_2_classes = {
#     "2-А": [32, 32, 496, 496 * PRICE, ' '],
#     "2-Б": [33, 33, 533, 533 * PRICE, ' '],
#     "2-В": [34, 34, 547, 547 * PRICE, ' ']
# }
# all_2_classes = "ДРУГІ"
#
# data_3_classes = {
#     "3-А": [30, 30, 440, 440 * PRICE, ' '],
#     "3-Б": [33, 33, 500, 500 * PRICE, ' '],
#     "3-В": [31, 31, 471, 471 * PRICE, ' '],
#     "3-Г": [31, 31, 512, 512 * PRICE, ' ']
# }
# all_3_classes = "ТРЕТІ"
#
# data_4_classes = {
#     "4-А": [34, 34, 527, 527 * PRICE, ' '],
#     "4-Б": [33, 33, 502, 502 * PRICE, ' '],
#     "4-В": [32, 32, 516, 516 * PRICE, ' ']
# }
# all_4_classes = "ЧЕТВЕРТІ"
